
## Plan Result




<pre><code>Plan: 13 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.flexible_secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;USER&#34;]
  * module.postgresql.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases[&#34;fact&#34;]
  * module.postgresql.azurerm_resource_group.rg[0]
  * module.postgresql.null_resource.set-user-permissions-additionaldbs[&#34;fact&#34;]
  * module.postgresql.random_password.password
* Update
  * module.reform-blob-router-db.azurerm_resource_group.data-resourcegroup
  * module.reform-blob-router-db.azurerm_template_deployment.postgres-paas
  * module.reform-blob-router-staging-db.azurerm_resource_group.data-resourcegroup
  * module.reform-blob-router-staging-db.azurerm_template_deployment.postgres-paas


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.flexible_secret["DATABASE"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat"
      + name                    = "blob-router-POSTGRES-FLEXIBLE-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "blob-router PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret["HOST"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat"
      + name                    = "blob-router-POSTGRES-FLEXIBLE-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "blob-router PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret["PASS"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat"
      + name                    = "blob-router-POSTGRES-FLEXIBLE-PASS"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "blob-router PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret["PORT"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat"
      + name                    = "blob-router-POSTGRES-FLEXIBLE-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "blob-router PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret["USER"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat"
      + name                    = "blob-router-POSTGRES-FLEXIBLE-USER"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "blob-router PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.postgresql.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "blobrouter_user"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = false
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgresql"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "reform-scan-blob-router-flexible-postgres-db-v15-aat"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "reform-scan-blob-router-flexible-postgres-db-v15-data-aat"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + tags                          = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
        }
      + version                       = "15"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "reform-scan-blob-router-flexible-postgres-db-v15-data-aat"
      + server_name         = "reform-scan-blob-router-flexible-postgres-db-v15-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + principal_name      = "jenkins-cftptl-intsvc-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "reform-scan-blob-router-flexible-postgres-db-v15-data-aat"
      + server_name         = "reform-scan-blob-router-flexible-postgres-db-v15-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases["fact"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "fact"
      + server_id = (known after apply)
    }

  # module.postgresql.azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "reform-scan-blob-router-flexible-postgres-db-v15-data-aat"
      + tags     = {
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
        }
    }

  # module.postgresql.null_resource.set-user-permissions-additionaldbs["fact"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS CFT DB Access Reader"
          + "force_trigger"  = ""
          + "name"           = "reform-scan-blob-router-flexible-postgres-db-v15"
          + "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        }
    }

  # module.postgresql.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.reform-blob-router-db.data.azurerm_postgresql_server.replica will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_postgresql_server" "replica" {
      + administrator_login = (known after apply)
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + identity            = (known after apply)
      + location            = (known after apply)
      + name                = "blob-router-aat"
      + resource_group_name = "blob-router-data-aat"
      + sku_name            = (known after apply)
      + tags                = (known after apply)
      + version             = (known after apply)
    }

  # module.reform-blob-router-db.azurerm_resource_group.data-resourcegroup will be updated in-place
  ~ resource "azurerm_resource_group" "data-resourcegroup" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/blob-router-data-aat"
        name     = "blob-router-data-aat"
      ~ tags     = {
            "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
        }
        # (1 unchanged attribute hidden)
    }

  # module.reform-blob-router-db.azurerm_template_deployment.postgres-paas will be updated in-place
  ~ resource "azurerm_template_deployment" "postgres-paas" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/blob-router-data-aat/providers/Microsoft.Resources/deployments/blob-router-aat"
        name                = "blob-router-aat"
      ~ parameters          = {
          ~ "commonTags"                 = "eyJhcHBsaWNhdGlvbiI6ImJ1bGstc2Nhbi1wcmludCIsImJ1aWx0RnJvbSI6Imh0dHBzOi8vZ2l0aHViLmNvbS9ITUNUUy9ibG9iLXJvdXRlci1zZXJ2aWNlLmdpdCIsImJ1c2luZXNzQXJlYSI6IkNGVCIsImNvbnRhY3RTbGFja0NoYW5uZWwiOiIjcmJzIiwiZW52aXJvbm1lbnQiOiJzdGFnaW5nIiwibWFuYWdlZEJ5IjoiQnVsayBTY2FubmluZyBhbmQgUHJpbnRpbmcifQ==" -> "eyJhcHBsaWNhdGlvbiI6ImJ1bGstc2Nhbi1wcmludCIsImF1dG9TaHV0ZG93biI6InRydWUiLCJidWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvYmxvYi1yb3V0ZXItc2VydmljZS5naXQiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI3JicyIsImVudmlyb25tZW50Ijoic3RhZ2luZyIsIm1hbmFnZWRCeSI6IkJ1bGsgU2Nhbm5pbmcgYW5kIFByaW50aW5nIn0="
            # (17 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.reform-blob-router-staging-db.data.azurerm_postgresql_server.replica will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_postgresql_server" "replica" {
      + administrator_login = (known after apply)
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + identity            = (known after apply)
      + location            = (known after apply)
      + name                = "blob-router-staging-aat"
      + resource_group_name = "blob-router-staging-data-aat"
      + sku_name            = (known after apply)
      + tags                = (known after apply)
      + version             = (known after apply)
    }

  # module.reform-blob-router-staging-db.azurerm_resource_group.data-resourcegroup will be updated in-place
  ~ resource "azurerm_resource_group" "data-resourcegroup" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/blob-router-staging-data-aat"
        name     = "blob-router-staging-data-aat"
      ~ tags     = {
            "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
        }
        # (1 unchanged attribute hidden)
    }

  # module.reform-blob-router-staging-db.azurerm_template_deployment.postgres-paas will be updated in-place
  ~ resource "azurerm_template_deployment" "postgres-paas" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/blob-router-staging-data-aat/providers/Microsoft.Resources/deployments/blob-router-staging-aat"
        name                = "blob-router-staging-aat"
      ~ parameters          = {
          ~ "commonTags"                 = "eyJhcHBsaWNhdGlvbiI6ImJ1bGstc2Nhbi1wcmludCIsImJ1aWx0RnJvbSI6Imh0dHBzOi8vZ2l0aHViLmNvbS9ITUNUUy9ibG9iLXJvdXRlci1zZXJ2aWNlLmdpdCIsImJ1c2luZXNzQXJlYSI6IkNGVCIsImNvbnRhY3RTbGFja0NoYW5uZWwiOiIjcmJzIiwiZW52aXJvbm1lbnQiOiJzdGFnaW5nIiwibWFuYWdlZEJ5IjoiQnVsayBTY2FubmluZyBhbmQgUHJpbnRpbmcifQ==" -> "eyJhcHBsaWNhdGlvbiI6ImJ1bGstc2Nhbi1wcmludCIsImF1dG9TaHV0ZG93biI6InRydWUiLCJidWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvYmxvYi1yb3V0ZXItc2VydmljZS5naXQiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI3JicyIsImVudmlyb25tZW50Ijoic3RhZ2luZyIsIm1hbmFnZWRCeSI6IkJ1bGsgU2Nhbm5pbmcgYW5kIFByaW50aW5nIn0="
            # (17 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

Plan: 13 to add, 4 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2126,"Program":"tfcmt","SHA1":"","Vars":{}} -->